#+BLOG: myblog
#+POSTID: 153
#+DATE: [2022-04-28 Thu 22:19]
#+TITLE: Sed
#+STARTUP:show2levels
** Note
We all know that the three musketeers of Linux are grep, sed and awk, =grep= have a more useful version called =egrep=, which support extend regular expression.(we will recommend it below.)
1. =sed= and =grep= don't support extend regex.
2. =egrep= and =awk= support extend regex.
So, they have different regular expression when they used. For example
#+begin_src shell
#!/bin/bash
echo '{}' | sed -n '/{}/p'
echo "This is a seperator"
echo '{}' | awk '/\{\}/ { print }'
#+end_src
Like extended regex introduced follow, if sed and awk want to match ~()~ and ~{}~, don't need escape, but if want to match ~[]~ you must to escape it, like ~\[\]~.
#+begin_src shell
echo '[]' | sed -n '/\[\]/p'
echo '{}' | sed -n '/{}/p'
echo '()' | sed -n '/()/p'
#+end_src

#+RESULTS:
| [] |
| {} |
| () |

** Use shell variable in sed or awk
If you want to use shell variable in sed or awk, you must use double quote not single quote. ~$~ in single quote not expand. You should first escape the escape symbol ~\~.
 #+begin_src shell
variable="{}"
echo "{}" | sed -n "/$variable/p"
echo "aaa" | sed -n "/a\\{3\\}/p"
echo "a{}" | sed -n "/a{}/p"
 #+end_src

 #+RESULTS:
 | {}  |
 | aaa |
 | a{} |

